global_esb/src/main/resources/static/requestExample.xml

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
    <Body>
        <actionRequest xmlns="http://esb.sn/esmt" mainAction="ACTIVATE" requestId="0000000000533" senderId="IL" timeStamp="">
            <actionParameter paramName="OFFER_TYPE" oldValue="" newValue="MOB_PREPAID"></actionParameter>
            <actionOffer offerName="SVC_OPER_BARR" verb="ADD">
                <actionService serviceName="SVC_ROAMING" verb="ADD">
                    <actionParameter paramName="RESTRICTION" newValue="PLMNLIST" oldValue=""/>
                </actionService>
            </actionOffer>
            <actionOffer offerName="SVC_IN" verb="ADD">
                <actionService serviceName="SVC_CONFIG_IN" verb="ADD"/>
                <actionParameter paramName="PROFILE" newValue="Jamono New Scool" oldValue=""/>
                <actionParameter paramName="SUBSCRIBERSTATUS" newValue="Preactive" oldValue=""/>
                <actionParameter paramName="PROVIDERID" newValue="7" oldValue=""/>
                <actionParameter paramName="PRODUCT_CODE" newValue="9131" oldValue=""/>
                <actionService serviceName="SVC_DEPOT_PASS" verb="ADD">
                    <actionParameter paramName="PRICEPLANINDEX" newValue="99298" oldValue=""/>
                </actionService>
            </actionOffer>
            <actionOffer offerName="SVC_VOICE" verb="ADD">
                <actionService serviceName="SVC_BTEL" verb="ADD"/>
                <actionService serviceName="SVC_CFBUSY" verb="ADD"/>
                <actionService serviceName="SVC_CFNREACH" verb="ADD"/>
                <actionService serviceName="SVC_CFNREPLY" verb="ADD"/>
                <actionService serviceName="SVC_CLIP" verb="ADD"/>
                <actionService serviceName="SVC_CHS" verb="ADD"/>
                <actionService serviceName="SVC_CWS" verb="ADD"/>
                <actionService serviceName="SVC_VOLTE" verb="ADD"/>
            </actionOffer>
            <actionOffer offerName="SVC_DATA" verb="ADD">
                <actionService serviceName="SVC_GPRS" verb="ADD"/>
                <actionService serviceName="SVC_SMS_MOMT" verb="ADD"/>
                <actionService serviceName="SVC_3G" verb="ADD"/>
                <actionService serviceName="SVC_3GVISIO" verb="ADD"/>
                <actionService serviceName="SVC_LTE" verb="ADD">
                    <actionParameter paramName="PROFILE_LTE" newValue="PILOTE_LTE" oldValue=""/>
                </actionService>
                <actionService serviceName="SVC_5G" verb="ADD">
                    <actionParameter paramName="PROFILE_VOLTE" newValue="PILOTE_LTE" oldValue=""/>
                </actionService>
            </actionOffer>
            <actionOffer offerName="SOS_DONNEES_COMMUNES" verb="ADD">
                <actionService serviceName="CS_TELEPHONE_MOBILE" verb="ADD"/>
                <actionService serviceName="CS_NUMERO_TELEPHONE" verb="ADD">
                    <actionParameter paramName="MSISDN" newValue="781617844" oldValue=""/>
                </actionService>
                <actionService serviceName="CS_CARTE_SIM" verb="ADD">
                    <actionParameter paramName="IMSI" newValue="608015149549271" oldValue=""/>
                    <actionParameter paramName="IMSI_KEY" newValue="X" oldValue=""/>
                </actionService>
            </actionOffer>
        </actionRequest>
    </Body>
</Envelope>